sv/artillery/artillery-script.yaml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: 10 PRS
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Ramp up load from 10 to 100
    - duration: 60
      arrivalRate: 100
      name: 100 PRS
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: Ramp up load from 100 to 1,000
    - duration: 60
      arrivalRate: 1000
      name: 1,000 PRS


scenarios:
  - name: "Similar Products (GET REQUEST STRESS TESTING)"
    flow:
      - get:
          url: "/{{$randomNumber(1,100)}}"